Documents/си_ВводНачальныхОстатковМатериаловВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>си_ВводНачальныхОстатковМатериаловВЭксплуатации</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.си_МатериалыНаСкладе</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
				<xr:Item>AccumulationRegister.си_МатериалыВЭксплуатации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаНУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУчетаНУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьКПН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.си_СостоянияМатериалов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаточнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаточныйСрокСлужбы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеИспользования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.си_НазначенияИспользования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПередачиВЭксплуатацию</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПередачи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.си_ПередачаМатериаловВЭксплуатацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.си_ХарактеристикиСпецодеждыИИнвентаря</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/си_ВводНачальныхОстатковМатериаловВЭксплуатации/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.си_ВводНачальныхОстатковМатериаловВЭксплуатации.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	си_УчетСпецодеждыУправлениеПроведениемДокументовСервер.СформироватьДвиженияПоРегистрам(ПараметрыПроведения.Реквизиты, ПараметрыПроведения.ТаблицаМатериалы, Движения, Отказ,"Материалы","си_УчетСпецодеждыСервер","ЗарегистрироватьДвиженияВводНачальныхОстатков",,);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Отказ = си_УчетСпецодеждыСервер.ПроверкаЗаполненияСтруктурнойЕдиницы(Организация,СтруктурноеПодразделение);
	си_УчетСпецодеждыСервер.ПроверкаЗаполненияСкладаВТабличнойЧасти(Материалы, Отказ);
	МассивНепроверяемыхРеквизитов = Новый Массив();
	Если УчитыватьКПН Тогда
		Если ЗначениеЗаполнено(ВидУчетаНУ) Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ВидУчетаНУ");
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Заполните Вид учета НУ");
			Отказ = Истина;	
		КонецЕсли;
	КонецЕсли;
	
	си_ОбщегоНазначения.ИсключитьПроверку(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
	ЕстьРеквизитСпецодежда = Метаданные.Справочники.Номенклатура.Реквизиты.Найти("си_ЯвляетсяСпецодеждойИнвентарем");
	
	Для Каждого СтрокаТЧ Из Материалы Цикл
		ИндексСтроки = Формат(СтрокаТЧ.НомерСтроки-1,"ЧГ=");
		Если Не СтрокаТЧ.Состояние = Перечисления.си_СостоянияМатериалов.НаходящиесяНаСкладеНовая Тогда
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаПередачиВЭксплуатацию) Тогда 
				ОбщегоНазначения.СообщитьПользователю("В строке №" + СтрокаТЧ.НомерСтроки + " не заполнена дата передачи в эксплуатацию",ЭтотОбъект,"Материалы["+ИндексСтроки+"].ДатаПередачиВЭксплуатацию");
				Отказ = Истина;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаТЧ.ДокументПередачи) Тогда 
				ОбщегоНазначения.СообщитьПользователю("В строке №" + СтрокаТЧ.НомерСтроки + " не заполнен документ передачи",ЭтотОбъект,"Материалы["+ИндексСтроки+"].ДокументПередачи");
				Отказ = Истина;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаТЧ.НазначениеИспользования) Тогда 
				ОбщегоНазначения.СообщитьПользователю("В строке №" + СтрокаТЧ.НомерСтроки + " не заполнено назначение использования",ЭтотОбъект,"Материалы["+ИндексСтроки+"].НазначениеИспользования");
				Отказ = Истина;
			ИначеЕсли СтрокаТЧ.НазначениеИспользования.СпособПогашенияСтоимости=Перечисления.си_СпособыПогашенияСтоимости.ПриПередачеВЭксплуатацию И СтрокаТЧ.ОстаточнаяСтоимость>0 Тогда 
				ОбщегоНазначения.СообщитьПользователю("В строке №" + СтрокаТЧ.НомерСтроки + " указана остаточная стоимость, что не предусмотрено параметрами назначения использования",ЭтотОбъект,"Материалы["+ИндексСтроки+"].ОстаточнаяСтоимость");
				Отказ = Истина;
			КонецЕсли;
			Если СтрокаТЧ.Состояние = Перечисления.си_СостоянияМатериалов.НаходящиесяВЭксплуатации Тогда
				Если Не ЗначениеЗаполнено(СтрокаТЧ.ПодразделениеОрганизации) Тогда 
					ОбщегоНазначения.СообщитьПользователю("В строке №" + СтрокаТЧ.НомерСтроки + " не заполнено подразделение организации",ЭтотОбъект,"Материалы["+ИндексСтроки+"].ПодразделениеОрганизации");
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЕстьРеквизитСпецодежда = Неопределено Тогда
			Если Не СтрокаТЧ.Номенклатура.си_ЯвляетсяСпецодеждойИнвентарем Тогда
				ОбщегоНазначения.СообщитьПользователю("В строке №" + СтрокаТЧ.НомерСтроки + " указана номенклатурная позиция, у которой не установлен признак принадлежности к спецодежде или инвентарю",ЭтотОбъект,"Материалы["+ИндексСтроки+"].Номенклатура");
				Отказ = Истина;
			КонецЕсли;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("В справочнике номенклатура отстутствует необходимый реквизит ""Является спецодеждой или инвентарем"". Проверьте корректность встраивания дополнения",ЭтотОбъект,"Материалы["+ИндексСтроки+"].Номенклатура");
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПроверкаНаСтоимостьПриВыбранномСпособеПогашения(Отказ);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	общ_ПереопределяемыеПроцедурыБКСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет не установлена ли стоимость для позиции если выбран способ погашения стоимости "При передачи в эксплуатацию"
//
Процедура ПроверкаНаСтоимостьПриВыбранномСпособеПогашения(Отказ)
	Для Каждого СтрокаТЧ Из Материалы Цикл
		Если СтрокаТЧ.НазначениеИспользования.СпособПогашенияСтоимости = Перечисления.си_СпособыПогашенияСтоимости.ПриПередачеВЭксплуатацию 
			И НЕ СтрокаТЧ.ОстаточнаяСтоимость = 0 Тогда
			Отказ = Истина;
			Сообщить("Строка № "+СтрокаТЧ.НомерСтроки+": Остаточная стоимость не равна нулю, спосособ погашения "+СтрокаТЧ.НазначениеИспользования.СпособПогашенияСтоимости + ", назначение использования "+СтрокаТЧ.НазначениеИспользования);
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
